## Terraform Plan Results

| Step | Status |
|------|--------|
| 🖌️ Format | ✅ Passed |
| ⚙️ Init | ✅ Passed |
| 📝 Validate | ✅ Passed |
| 📋 Plan | ✅ Passed |

<details>
<summary>Show Plan Output</summary>

```terraform
data.archive_file.lambda: Reading...
cloudflare_turnstile_widget.ifs_widget: Refreshing state... [id=0x4AAAAAACZ8FGkiyBlJ5f7M]
data.archive_file.lambda: Read complete after 0s [id=c3f069b77a18594e043e8e4a55fd0f7f8f19f4f0]
aws_acm_certificate.subdomain_cert: Refreshing state... [id=arn:aws:acm:us-east-1:533267177082:certificate/7ec35bb5-81ab-441c-8ef0-4a0804a82e9d]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
cloudflare_record.acm_certificate_cname: Refreshing state... [id=8fba275c16601a9e9facf00a351026c2]
aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E1CER2APENQ1UU]
aws_iam_role.lambda_role: Refreshing state... [id=ifs_lambda_role]
aws_s3_bucket.main_bucket: Refreshing state... [id=ifs-storage-bucket]
aws_lambda_function.upload_function: Refreshing state... [id=ifs_upload_function]
aws_lambda_function_url.upload_function_url: Refreshing state... [id=ifs_upload_function]
aws_s3_bucket_website_configuration.s3_site_config: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_public_access_block.allow_public_acl: Refreshing state... [id=ifs-storage-bucket]
aws_iam_policy.allow_s3_access: Refreshing state... [id=arn:aws:iam::533267177082:policy/ifs_s3_access_policy]
aws_s3_bucket_cors_configuration.allow_cors: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_lifecycle_configuration.one_day_lifetime: Refreshing state... [id=ifs-storage-bucket]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2C9XYLKDNE51M]
aws_s3_object.index_html: Refreshing state... [id=index.html]
aws_iam_role_policy_attachment.combined_policy_attachment: Refreshing state... [id=ifs_lambda_role/arn:aws:iam::533267177082:policy/ifs_s3_access_policy]
cloudflare_record.cloudfront_to_subdomain_cname: Refreshing state... [id=df1f447d6d68314b15b5e2ac8132a13b]
aws_s3_bucket_policy.main_bucket_policy: Refreshing state... [id=ifs-storage-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.vercel_landing_cname[0] will be created
  + resource "cloudflare_record" "vercel_landing_cname" {
      + allow_overwrite = false
      + comment         = "GENERATED BY TERRAFORM - for vercel landing page"
      + content         = "d756e5009a9b5a81.vercel-dns-017.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ifs"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "47e2c26d25d25ff12cb21a0b2a5e1a4d"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>